(function(){

/**
 * BEM-декларация блока позволяет сообщить, к какому блоку (блоку с модификатором,
 * блоку с определённым значением модификатора) относится данный JavaScript-компонент.
 *
 * Варианты деклараций можно найти на wiki-странице блока i-bem blocks/i-bem/i-bem.wiki
 */
BEM.DOM.decl('b-square', {

    onSquareClick : function(e) {

        /*
         Метод toggleMod переключает модификатор блока или элемента
         между двумя значениями. Сигнатуру метода можно узнать
         в справочнике по BEM /blocks/i-bem/i-bem.jsdoc.wiki
         */

        this.toggleMod('color', 'green', '');

    }

}, {

    live : function() {
        /*
         live-инициализация -- это "инициализация по требованию".
         Она позволяет делать инициализацю блока только тогда,
         когда это необходимо. Например, когда пользователь непосреддственно
         начал работать с блоком.
         В данном случае инициализация происходит по событию click на блоке.
         Инициализация также может происходить по событию на элементе блока,
         по факту инициализации вложенных или смиксованных блоков. Все
         доступные методы инициализации можно найти в справочнике по BEM DOM
         /blocks/i-bem/dom/i-bem__dom.jsdoc.wiki
         */

        this.liveBindTo('click', function(e) {
            this.onSquareClick();
        });

    }

});

}());