(function(){

/**
 * BEM-декларация блока позволяет сообщить, к какому блоку (блоку с модификатором,
 * блоку с определённым значением модификатора) относится данный JavaScript-компонент.
 *
 * В данном случае код срабатывает на блоке b-link_action_alert
 *
 * Варианты деклараций можно найти на wiki-странице блока i-bem blocks/i-bem/i-bem.wiki
 */
BEM.DOM.decl({ name: 'b-link', modName: 'action', modVal: 'alert' }, {

    /**
     * Метод _onClick называется так не случайно. Название должно совпадать с
     * названием метода блока-родителя, то есть b-link_pseudo_yes
     */
    _onClick: function(e) {

        // this.base содержит ссылку на соответствующий метод "родительского" компонента
        this.__base.apply(this, arguments);

        // Доопределяем базовый метод собственным кодом
        alert('Текстовое сообщение');

    }

});

}());