/**
 * BEM-декларация блока позволяет сообщить, к какому блоку (блоку с модификатором,
 * блоку с определённым значением модификатора) относится данный JavaScript-компонент.
 * Варианты деклараций можно найти на wiki-странице блока i-bem blocks/i-bem/i-bem.wiki
 */
BEM.DOM.decl('b-tv', {

    /*
     onSetMod -- это специальное свойство, позволяющее описать, как компонент
     должен реагровать на установку модицикатора у блока. Подробнее об onSetMod
     и вариантах его использования можно прочесть на wiki-странице
     блока i-bem (/blocks/i-bem/i-bem.wiki)
     */
    onSetMod : {

        js : function() {
            /*
             Метод setMod позволяет задать блоку или его элементу модификатор
             со значением. Подробнее об этом методе можно узнать в справочнике
             по BEM blocks/i-bem/i-bem.jsdoc.wiki
             */
            this.setMod('touched', 'yes');
        }

    },

    on : function(e) {
        this.setMod('state', 'profilaktika');
    },

    off : function(e) {
        this.setMod('state', '');
    }

}, {

    live : function() {

        /*
         live-инициализация -- это "инициализация по требованию".
         Она позволяет делать инициализацю блока только тогда,
         когда это необходимо. Например, когда пользователь непосреддственно
         начал работать с блоком.

         В данном случае инициализация происходит в любом из двух случаев:
         наведении курсора на элемент over или клику на элементе click.
         Инициализация также может происходить по событию на самом блоке,
         по факту инициализации вложенных или смиксованных блоков. Все
         доступные методы инициализации можно найти в справочнике
         по BEM DOM (/blocks/i-bem/dom/i-bem__dom.jsdoc.wiki).
         */

        this
            .liveBindTo('over', 'mouseover', function(e) {
                this.on();
            })
            .liveBindTo('click', 'click', function(e) {
                this.off();
            });

    }

});
